{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "trainable": true, "batch_input_shape": [null, 48, 48, 1], "input_dtype": "float32", "nb_filter": 32, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "output_dim": 128, "init": "lecun_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 16928}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.4}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "output_dim": 7, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 128}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "softmax"}}], "keras_version": "1.2.2"}